"""
Использовать библиотеку NumPy
Сгенерировать два одномерных массива m1 и m2 размерностью 10 (значения от 1 до 10).
1) Сформировать на их основе массив m3, содержащий только те элементы, которые есть либо только в массиве m1, либо только в массиве m2.
2) Заменить в первом массиве все значения, кратные 3 или 2 на число 1, а остальные – оставить без изменений.
3) Слить массивы m1 и m2 в один и преобразовать получившийся одномерный массив в матрицу размерностью 4х5. Вывести ее на экран.
4) Удалить из матрицы 1 и 4 столбцы.
5) Транспонировать полученную матрицу.
"""
