"""
С клавиатуры вводится количество стран K. Затем вводится  K строк, в каждой из которых указывается название страны и список городов в этой стране через пробел. Затем пользователь вводит 3 названия городов, после чего программа сообщает, в какой стране они находятся. Если такого города нет, то вывести соответствующее сообщение. (1 балл)

#### Пример:
````
Кол-во стран: 2
1 страна: Россия Москва Петербург Новгород
2 страна: Германия Берлин Лейпциг Мюнхен

1 город: Москва
Город Москва расположен в стране Россия.

2 город: Мюнхен
Город Мюнхен расположен в стране Германия.

3 город: Рим
По городу Рим данных нет.
````
"""
