"""
В архиве voina-i-mir.zip лежит роман Льва Толстого «Война и мир». Напишите программу, которая подсчитает статистику по буквам (русского и латинского алфавита) в этом романе и выведет результат в текстовый файл. Результат должен быть отсортирован по частоте встречаемости букв (по возрастанию или   убыванию). Регистр символов имеет значение. Постарайтесь написать программу так, чтобы для её работы не требовалась распаковка  архива “вручную” (изучите самостоятельно модуль zipfile для распаковки архива). (4 балла)
Ответ должен быть в таком виде (доли от 1):
Й 0.00000126
Z 0.00000253
W 0.00000674
Щ 0.00000716
….
и 0.06492206
а 0.07803966
е 0.07942622
о 0.11040234
"""
